modules/nixos/Emacs.org
#+TITLE: Emacs Configuration
SUBTITLE: Configuration for emacs
#+AUTHOR: Rachit Kumar Verma
#+DATE:<2026-02-09 Mon>
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes
#+auto_tangle: t

* Introduction
I am using Emacs with Nix Home-Manager, that too with stylix. Therefore, the theme and the fonts and other stuff about Emacs is already set by Stylix.

This whole configuration has been inspired from [[https://github.com/daviwil/emacs-from-scratch][Davi Will's Emacs From Scratch series]]. The file can be found [[https://github.com/daviwil/emacs-from-scratch/raw/master/Emacs.org][here]]. I only reference a few things, since the tutorial is old and a lot of new packages has come in. However, the tutorial will help a lot in learning
emacs, and it is greatly recommended.

Here is some basic set up.

The [[https://github.com/magnars/dash.el][dash]] library is required by a lot of packages.
#+begin_src emacs-lisp

  ;; -*- lexical-binding: t; -*-

  (use-package dash
    :init
    (global-dash-fontify-mode))

#+end_src

** Backup Directory

By Default random backup files are generated all through out the work directory. We can change it by using this.

#+begin_src emacs-lisp

  (let ((backup-dir (expand-file-name "backups/" user-emacs-directory))
        (autosave-dir (expand-file-name "auto-saves/" user-emacs-directory)))

    (make-directory backup-dir t)
    (make-directory autosave-dir t)
    
    ;; Backups
    (setq backup-directory-alist
  	`(("." . ,backup-dir))
  	backup-by-copying t
  	delete-old-versions t
  	kept-new-versions 10
  	kept-old-versions 5
  	version-control t)

    ;; Auto-saves
    (setq auto-save-file-name-transforms
  	`((".*" ,autosave-dir t))))

#+end_src

* Basic UI Configuration

** Early Init

This goes to [[file:early-init.el][early-init.el]] file.

#+begin_src emacs-lisp :tangle ./early-init.el :mkdirp yes

  (tool-bar-mode -1)
  (tooltip-mode -1)
  (menu-bar-mode -1)

  (setq frame-inhibit-implied-resize t)

  (setq default-frame-alist
        '((font . "Iosevka Nerd Font-11.5")))

#+end_src

** Theme

Kanagawa theme
#+begin_src emacs-lisp :tangle no

  (use-package kanagawa-themes
    :custom
    (kanagawa-themes-org-agenda-height t)
    (kanagawa-themes-org-bold t)
    (kanagawa-themes-org-height t)
    (kanagawa-themes-org-highlight t)
    (kanagawa-themes-org-priority-bold t)
    :config
    (load-theme 'kanagawa-dragon t))

#+end_src

Doom Themes: Tokyo-night

#+begin_src emacs-lisp

  (use-package doom-themes
    :ensure t
    :custom
    ;; Global settings (defaults)
    (doom-themes-enable-bold t)   ; if nil, bold is universally disabled
    (doom-themes-enable-italic t) ; if nil, italics is universally disabled
    ;; for treemacs users
    (doom-themes-treemacs-theme "doom-colors") ; use "doom-colors" for less minimal icon theme
    :config
    (load-theme 'doom-tokyo-night t)

    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)
    ;; Enable custom neotree theme (nerd-icons must be installed!)
    (doom-themes-neotree-config)
    ;; or for treemacs users
    (doom-themes-treemacs-config)
    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config))

#+end_src

** Transparency

#+begin_src emacs-lisp

  (add-to-list 'default-frame-alist '(alpha-background . 90))

#+end_src

** Other Basics

#+begin_src emacs-lisp

  (scroll-bar-mode -1)
  (setq inhibit-startup-message t)
  (setq visible-bell t)
  (fringe-mode 0)
  (global-hl-line-mode 1) ;; Cursorcolumn like equivalent in emacs

  ;; Use Relative Line Numbers
  (column-number-mode)
  (setq display-line-numbers-type 'relative)
  (global-display-line-numbers-mode t)

  ;; Turn off line-numbers in some modes:
  (dolist (mode '(org-mode-hook
    		term-mode-hook
    		shell-mode-hook
    		treemacs-mode-hook
    		eshell-mode-hook
    		vterm-mode-hook
    		reader-mode-hook))

    (add-hook mode (lambda () (display-line-numbers-mode 0))))

#+end_src

** Add Window Dividers and Frame Borders

#+begin_src emacs-lisp

  ;; Add frame borders and window dividers
  (modify-all-frames-parameters
   '((right-divider-width . 10)
     (internal-border-width . 10)))
  (dolist (face '(window-divider
                  window-divider-first-pixel
                  window-divider-last-pixel))
    (face-spec-reset-face face)
    (set-face-foreground face (face-attribute 'default :background)))

  (set-face-background 'fringe (face-attribute 'default :background))

  ;; This function is called in the font setup block,
  ;; because emacs client is not calling it propely.
  (defun my/variables-custom ()
    (setq line-spacing 0.2)) ;; Increase line-spacing a little

#+end_src

** Font Configuration

In emacsclient, the fonts need to be loaded based on frames.

#+begin_src emacs-lisp

  (defun my/frame-face-setup (frame)
    (with-selected-frame frame
      (set-face-attribute 'fixed-pitch frame
                          :family "Iosevka Nerd Font"
                          :height 1.0)

      (set-face-attribute 'variable-pitch frame
                          :family "Inter"
                          :height 1.13
                          :weight 'regular)))

  (add-hook 'after-make-frame-functions #'my/frame-face-setup)


#+end_src


Configure font sizes and types. Taken from [[https://systemcrafters.net/emacs-tips/using-the-emacs-daemon/][System Crafter's]] Emacs daemon mode configuration as a fallback.

#+begin_src emacs-lisp :tangle no

  (defun my/set-font-faces ()
    (message "Set Font Faces!")
    ;; Font size
    (set-face-attribute 'default nil
  		      :font "Iosevka Nerd Font"
  		      :height 120)

    ;; Set the fixed pitch face
    (set-face-attribute 'fixed-pitch nil
  		      :family "Iosevka Nerd Font"
  		      :height 1.0)

    ;; Set the variable pitch face
    (set-face-attribute 'variable-pitch nil
  		      :font "Inter"
  		      :height 1.14
  		      :weight 'regular))

  ;; When started in daemon mode, emacs doesn't load it properly. So there's this.
  (if (daemonp)
      (add-hook 'after-make-frame-functions
                (lambda (frame)
  		(setq doom-modeline-icon t)
  		(with-selected-frame frame
                    (my/set-font-faces)
  		  (my/variables-custom))))
    (my/set-font-faces))

#+end_src

** Ligatures Setup

[[https://github.com/mickeynp/ligature.el/wiki][ligatures.el]] enables using ligatures in emacs.

For Iosevka Nerd Font
#+begin_src emacs-lisp

  (use-package ligature
    :load-path "path-to-ligature-repo"
    :config
    ;; Enable all Iosevka ligatures in programming modes
    (ligature-set-ligatures 'prog-mode '("<---" "<--"  "<<-" "<-" "->" "-->" "--->" "<->" "<-->" "<--->" "<---->" "<!--"
                                         "<==" "<===" "<=" "=>" "=>>" "==>" "===>" ">=" "<=>" "<==>" "<===>" "<====>" "<!---"
                                         "<~~" "<~" "~>" "~~>" "::" ":::" "==" "!=" "===" "!=="
                                         ":=" ":-" ":+" "<*" "<*>" "*>" "<|" "<|>" "|>" "+:" "-:" "=:" "<******>" "++" "+++"))
    ;; Enables ligature checks globally in all buffers. You can also do it
    ;; per mode with `ligature-mode'.
    (global-ligature-mode t))

#+end_src

* Advanced UI Configuration

** Nerd Icons setup

#+begin_src emacs-lisp

  ;; General usage
  (use-package nerd-icons)

  ;; Use in ibuffer
  (use-package nerd-icons-ibuffer
    :hook (ibuffer-mode . nerd-icons-ibuffer-mode))

  ;; For completion in minibuffer
  (use-package nerd-icons-completion
    :after marginalia
    :config
    (nerd-icons-completion-mode)
    :hook (marginalia-mode nerd-icons-completion-marginalia-setup))

#+end_src

