modules/nixos/init.el
;; -*- lexical-binding: t; -*-

(use-package dash
  :init
  (global-dash-fontify-mode))

(let ((backup-dir (expand-file-name "backups/" user-emacs-directory))
      (autosave-dir (expand-file-name "auto-saves/" user-emacs-directory)))

  (make-directory backup-dir t)
  (make-directory autosave-dir t)
  
  ;; Backups
  (setq backup-directory-alist
	`(("." . ,backup-dir))
	backup-by-copying t
	delete-old-versions t
	kept-new-versions 10
	kept-old-versions 5
	version-control t)

  ;; Auto-saves
  (setq auto-save-file-name-transforms
	`((".*" ,autosave-dir t))))

(use-package doom-themes
  :ensure t
  :custom
  ;; Global settings (defaults)
  (doom-themes-enable-bold t)   ; if nil, bold is universally disabled
  (doom-themes-enable-italic t) ; if nil, italics is universally disabled
  ;; for treemacs users
  (doom-themes-treemacs-theme "doom-colors") ; use "doom-colors" for less minimal icon theme
  :config
  (load-theme 'doom-tokyo-night t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)
  ;; Enable custom neotree theme (nerd-icons must be installed!)
  (doom-themes-neotree-config)
  ;; or for treemacs users
  (doom-themes-treemacs-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))

(add-to-list 'default-frame-alist '(alpha-background . 90))

(scroll-bar-mode -1)
(setq inhibit-startup-message t)
(setq visible-bell t)
(fringe-mode 0)
(global-hl-line-mode 1) ;; Cursorcolumn like equivalent in emacs

;; Use Relative Line Numbers
(column-number-mode)
(setq display-line-numbers-type 'relative)
(global-display-line-numbers-mode t)

;; Turn off line-numbers in some modes:
(dolist (mode '(org-mode-hook
  		term-mode-hook
  		shell-mode-hook
  		treemacs-mode-hook
  		eshell-mode-hook
  		vterm-mode-hook
  		reader-mode-hook))

  (add-hook mode (lambda () (display-line-numbers-mode 0))))

;; Add frame borders and window dividers
(modify-all-frames-parameters
 '((right-divider-width . 10)
   (internal-border-width . 10)))
(dolist (face '(window-divider
                window-divider-first-pixel
                window-divider-last-pixel))
  (face-spec-reset-face face)
  (set-face-foreground face (face-attribute 'default :background)))

(set-face-background 'fringe (face-attribute 'default :background))

;; This function is called in the font setup block,
;; because emacs client is not calling it propely.
(defun my/variables-custom ()
  (setq line-spacing 0.2)) ;; Increase line-spacing a little

(defun my/frame-face-setup (frame)
  (with-selected-frame frame
    (set-face-attribute 'fixed-pitch frame
                        :family "Iosevka Nerd Font"
                        :height 1.0)

    (set-face-attribute 'variable-pitch frame
                        :family "Inter"
                        :height 1.13
                        :weight 'regular)))

(add-hook 'after-make-frame-functions #'my/frame-face-setup)

(use-package ligature
  :load-path "path-to-ligature-repo"
  :config
  ;; Enable all Iosevka ligatures in programming modes
  (ligature-set-ligatures 'prog-mode '("<---" "<--"  "<<-" "<-" "->" "-->" "--->" "<->" "<-->" "<--->" "<---->" "<!--"
                                       "<==" "<===" "<=" "=>" "=>>" "==>" "===>" ">=" "<=>" "<==>" "<===>" "<====>" "<!---"
                                       "<~~" "<~" "~>" "~~>" "::" ":::" "==" "!=" "===" "!=="
                                       ":=" ":-" ":+" "<*" "<*>" "*>" "<|" "<|>" "|>" "+:" "-:" "=:" "<******>" "++" "+++"))
  ;; Enables ligature checks globally in all buffers. You can also do it
  ;; per mode with `ligature-mode'.
  (global-ligature-mode t))

;; General usage
(use-package nerd-icons)

;; Use in ibuffer
(use-package nerd-icons-ibuffer
  :hook (ibuffer-mode . nerd-icons-ibuffer-mode))

;; For completion in minibuffer
(use-package nerd-icons-completion
  :after marginalia
  :config
  (nerd-icons-completion-mode)
  :hook (marginalia-mode nerd-icons-completion-marginalia-setup))

(use-package dired
  :config
  (setq dired-listing-switches
