modules/nixos/init.el
        "-l --almost-all --human-readable --group-directories-first --no-group")
  ;; this command is useful when you want to close the window of `dirvish-side'
  ;; automatically when opening a file
  (put 'dired-find-alternate-file 'disabled nil))

(use-package dirvish
  :ensure t
  :init
  (dirvish-override-dired-mode)
  :custom
  (dirvish-quick-access-entries ; It's a custom option, `setq' won't work
   '(("h" "~/"                          "Home")
     ("d" "~/Downloads/"                "Downloads")
     ("m" "/mnt/"                       "Drives")
     ("s" "/ssh:my-remote-server"      "SSH server")
     ("e" "/sudo:root@localhost:/etc"  "Modify program settings")
     ("t" "~/.local/share/Trash/files/" "TrashCan")))

  :config
  ;; (dirvish-peek-mode)             ; Preview files in minibuffer
  ;; (dirvish-side-follow-mode)      ; similar to `treemacs-follow-mode'

  (setq delete-by-moving-to-trash t) ;; does what it says
  (setq dirvish-mode-line-format
        '(:left (sort symlink) :right (omit yank index)))
  (setq dirvish-attributes           ; The order *MATTERS* for some attributes
        '(vc-state subtree-state nerd-icons collapse git-msg file-time file-size)
        dirvish-side-attributes
        '(vc-state nerd-icons collapse file-size))
  ;; open large directory (over 20000 files) asynchronously with `fd' command
  (setq dirvish-large-directory-threshold 20000)
  (setq dirvish-subtree-state-style 'nerd)
  (setq dirvish-path-separators (list
				 (format "  %s " (nerd-icons-codicon "nf-cod-home"))
				 (format "  %s " (nerd-icons-codicon "nf-cod-root_folder"))
				 (format " %s " (nerd-icons-faicon "nf-fa-angle_right"))))
  (dirvish-peek-mode) ;; Preview files in minibuffer
  (dirvish-side-follow-mode)
  
  :bind ; Bind `dirvish-fd|dirvish-side|dirvish-dwim' as you see fit
  (("C-c f" . dirvish)
   :map dirvish-mode-map               ; Dirvish inherits `dired-mode-map'
   (";"   . dired-up-directory)        ; So you can adjust `dired' bindings here
   ("?"   . dirvish-dispatch)          ; [?] a helpful cheatsheet
   ("a"   . dirvish-setup-menu)        ; [a]ttributes settings:`t' toggles mtime, `f' toggles fullframe, etc.
   ("f"   . dirvish-file-info-menu)    ; [f]ile info
   ("o"   . dirvish-quick-access)      ; [o]pen `dirvish-quick-access-entries'
   ("s"   . dirvish-quicksort)         ; [s]ort flie list
   ("r"   . dirvish-history-jump)      ; [r]ecent visited
   ("l"   . dirvish-ls-switches-menu)  ; [l]s command flags
   ("v"   . dirvish-vc-menu)           ; [v]ersion control commands
   ("*"   . dirvish-mark-menu)
   ("y"   . dirvish-yank-menu)
   ("N"   . dirvish-narrow)
   ("^"   . dirvish-history-last)
   ("TAB" . dirvish-subtree-toggle)
   ("M-f" . dirvish-history-go-forward)
   ("M-b" . dirvish-history-go-backward)
   ("M-e" . dirvish-emerge-menu)))

(use-package media-progress-dirvish
  :after dirvish
  :config
  (media-progress-dirvish-setup))

(use-package dired-x
  :config
  ;; Make dired-omit-mode hide all "dotfiles"
  (setq dired-omit-files
	(concat dired-omit-files "\\|^\\..*$")))

(use-package treemacs-nerd-icons
  :config
  (treemacs-nerd-icons-config))

(use-package dired-open-with
  :after dirvish)

(use-package doom-modeline
  :custom
  (doom-modeline-hud t)
  (doom-modeline-major-mode-color-icon t)
  
  :init
  (doom-modeline-mode 1))

(use-package which-key
  :defer 0
  :diminish which-key-mode
  :custom
  (which-key-idle-delay 1)
  :config
  (which-key-mode))

;; Enable vertico
(use-package vertico
  :custom
  (vertico-scroll-margin 0)
  (vertico-count 10)
  (vertico-resize t)
  (vertico-cycle t)
  :init
  (vertico-mode))

;; Presist history over emacs restarts.
(use-package savehist
  :init
  (savehist-mode))



;; Marginalia for margins
(use-package marginalia
  :bind (:map minibuffer-local-map
	      ("M-A" . marginalia-cycle))
  :init
  (marginalia-mode))

(use-package dashboard
  :custom
  (initial-buffer-choice 'dashboard-open) ;; When using emacsclient
  (dashboard-center-content t)
  (dashboard-vertically-center-content t)
  (dashboard-navigation-cycle t)

  ;; Using icons in dashboard
  (dashboard-display-icons-p t)
  (dashboard-icon-type 'nerd-icons)
  (dashboard-set-heading-icons t)
  (dashboard-set-file-icons t)

  ;; (setq dashboard-projects-switch-function (lambda (&rest _) consult-projectile-switch-project))
  
  (dashboard-projects-switch-function #'projectile-switch-project)
  (dashboard-startup-banner "~/.face")
  (dashboard-image-banner-max-heigth 200)
  (dashboard-image-banner-max-width 200)
  (dashboard-banner-logo-title "お帰りなさい!")

  ;; Customize which items are displayed
  (dashboard-items '((recents   . 5)
                     (bookmarks . 5)
                     (projects  . 5)
                     (agenda    . 5)
                     (registers . 5)))
  
  ;; Customize item shortcuts
  (dashboard-item-shortcuts '((recents   . "r")
                              (bookmarks . "m")
                              (projects  . "p")
                              (agenda    . "a")
                              (registers . "e")))

  ;; Customize the widgets on the dashboard
  (dashboard-startupify-list '(dashboard-insert-banner
                               dashboard-insert-newline
                               dashboard-insert-banner-title
                               dashboard-insert-newline
                               dashboard-insert-navigator
                               dashboard-insert-newline
                               dashboard-insert-init-info
                               dashboard-insert-items
                               dashboard-insert-newline
                               dashboard-insert-footer))
  
  ;; modify icon height and vertical adjust
  ;; (dashboard-icon-file-height 1.75)
  ;; (dashboard-icon-file-v-adjust -0.125)
  ;; (dashboard-heading-icon-height 1.75)
  ;; (dashboard-heading-icon-v-adjust -0.125)
  
  :hook
  (server-after-make-frame . 'dashboard-open) ;; When using emacsclient
  (dashboard-mode . page-break-lines-mode)
  
  :config
  (dashboard-setup-startup-hook))
