modules/nixos/Emacs.org
** Highlight =TODO= Keywords
#+begin_src emacs-lisp

  (use-package hl-todo
    :hook (prog-mode . hl-todo-mode)
    :config
    (setq hl-todo-highlight-punctuation ":"
  	hl-todo-keyword-faces
  	'(
            ;; Critical
            ("FIXME" . "#ea6962") ; red
            ("BUG"   . "#ea6962")

            ;; Urgent but not broken
            ("TODO"  . "#e78a4e") ; orange

            ;; Suspicious / tech debt
            ("HACK"  . "#d8a657") ; yellow
            ("XXX"   . "#d8a657")

            ;; Informational
            ("NOTE"  . "#7daea3") ; aqua
            ("INFO"  . "#7daea3")

            ;; Future ideas
            ("IDEA"  . "#a9b665") ; green
            )))

#+end_src

** Pulsar
Pulse the cursor using the [[https://protesilaos.com/emacs/pulsar][pulsar]] package.
#+begin_src emacs-lisp

  (use-package pulsar
    :bind
    ( :map global-map
      ("C-x l" . pulsar-pulse-line) ;; overrides 'count-lines-page'
      ("C-x L" . pulsar-highlight-permanently-dwim))
    :init
    (pulsar-global-mode 1)
    :config
    (setq pulsar-delay 0.055)
    (setq pulsar-iterations 5)
    (setq pulsar-face 'pulsar-green)
    (setq pulsar-region-face 'pulsar-yellow)
    (setq pulsar-highlight-face 'pulsar-magenta)
    :hook
    (next-error . #'pulsar-pulse-line)
    (minibuffer-setup-hook . #'pulsar-pulse-line))

#+end_src

** Pretty Info

Info mode by default looks arcane. Use[[https://github.com/ubolonton/info-colors][ info-colors]] for prettifying it a bit.

#+begin_src emacs-lisp

  (use-package info-colors
    :hook (Info-selection . info-colors-fontify-node))

#+end_src

* Keep Folders Clean
[[https://github.com/emacscollective/no-littering.git][no-littering]] is currently not downloading in NixOS. IDK Why.
#+begin_src emacs-lisp

  (use-package no-littering)

#+end_src

* Org Mode

** Basic Setup

A basic setup of org-mode.

#+begin_src  emacs-lisp

  (defun my/org-mode-setup ()
    (variable-pitch-mode 1)
    (visual-line-mode 1)
    (org-indent-mode))

  (defun my/org-font-setup ()
    ;; Resize Org headings
    (dolist (face '((org-level-1 . 1.35)
                    (org-level-2 . 1.3)
                    (org-level-3 . 1.2)
                    (org-level-4 . 1.1)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil
  			:font "Inter"
  			:weight 'bold
  			:height (cdr face)))

    ;; Make the document title a bit bigger
    (set-face-attribute 'org-document-title nil
  		      :font "Inter"
  		      :weight 'bold
  		      :height 1.8)
    
    (require 'org-indent)
    
    (set-face-attribute 'org-indent nil
  		      :inherit '(org-hide fixed-pitch))
    
    (set-face-attribute 'org-block nil
  		      :inherit 'fixed-pitch
  		      :height 0.9)
    
    (set-face-attribute 'org-code nil
  		      :inherit 'fixed-pitch
  		      :height 0.9)
    
    (set-face-attribute 'org-verbatim nil
  		      :inherit 'fixed-pitch
  		      :height 0.9)
    
    (set-face-attribute 'org-special-keyword nil
  		      :inherit '(font-lock-comment-face fixed-pitch))
    
    (set-face-attribute 'org-meta-line nil
  		      :inherit '(font-lock-comment-face fixed-pitch))
    
    (set-face-attribute 'org-checkbox nil
  		      :inherit 'fixed-pitch))


  (use-package org
    :commands (org-capture org-agenda)
    :hook
    (org-mode . my/org-mode-setup)
    (org-mode . my/org-font-setup)
    :custom
    (org-hide-leading-stars t)
    (org-adapt-indentation t)
    (org-src-fontify-natively t) ;; native src fonts
    (org-src-tab-acts-natively t) ;; let tab act as it would when writing code
    (org-ellipsis "  ")
    (org-link-descriptive t)
    
    :config
    ;; Enable org templates
    (require 'org-tempo)
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    

    ;; Configuring org-capture

    ;; First set the default org notes directory
    (setq org-directory "~/org"
      	org-default-notes-file (expand-file-name "tasks.org" org-directory))
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)

    (setq org-refile-targets
  	'(("archive.org" :maxlevel . 1)
  	  ("tasks.org" :maxlevel . 1)))

    ;; Save org buffers after refiling
    (advice-add 'org-refile
  	      :after 'org-save-all-org-buffers)
    
    (setq org-capture-templates
  	'(("t" "Tasks / Projects")
  	  ("tt" "Task" entry
             (file+headline "tasks.org" "Inbox")
             "* TODO %?\n  %U\n %a\n %i" :empty-lines 1)

  	  ("j" "Journal Entries")
            ("jj" "Journal" entry
             (file+olp+datetree "~/org/journal.org")
             "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
             ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
             :clock-in :clock-resume
             :empty-lines 1)))

    (defun my/org-capture-task ()
      (interactive)
      (org-capture nil "tt"))

    (defun my/org-capture-journal ()
      (interactive)
      (org-capture nil "jj"))

    (keymap-global-set "C-c t" #'my/org-capture-task)
    (keymap-global-set "C-c j" #'my/org-capture-journal))

#+end_src
    
** Org Modern Setup

This is [[https://github.com/rachitve6h2g/org-modern][org-modern]] for pretifying your org file setup.

#+begin_src emacs-lisp

  (use-package org-modern
    :custom
    (org-auto-align-tags t)
    (org-tags-column 0)
    (org-fold-catch-invisible-edits 'show-and-error)
    (org-special-ctrl-a/e t)
    (org-insert-heading-respect-content t)
    
    ;; Hide markups or not
    (org-pretty-entities t)
    (org-agenda-tags-column 0)
    
    :hook
    
    (org-mode . org-modern-mode)
    (org-agenda-finalize . org-modern-agenda)
    
    :config
    (global-org-modern-mode))

  ;; Use org-modern indent for using org-indent with org-modern
  (use-package org-modern-indent
    :defer t
    :custom (org-startup-indented t) ;; Adds a sort of '#+STARTUP: indent' to all org files
    :hook (org-mode . org-modern-indent-mode))

#+end_src

** Org Auto Tangle

Use auto tangle using [[https://github.com/yilkalargaw/org-auto-tangle][org-auto-tangle]] package. Just set =auto_tangle: t= as the header, and you're set.

#+begin_src emacs-lisp

  (use-package org-auto-tangle
    :after org
    :defer t
    :hook (org-mode . org-auto-tangle-mode))

#+end_src

** Center Org Buffers

Use olivetti:
 
#+begin_src emacs-lisp

  (use-package olivetti
    :custom (olivetti-body-width 100)
    :hook (org-mode . olivetti-mode))

#+end_src

** Babel Languages

Babel languages make writing code blocks easier.

#+begin_src emacs-lisp

  (with-eval-after-load 'org
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (C . t))))

#+end_src

** Org Roam (My Second Brain)

#+begin_src emacs-lisp

  (use-package org-roam
    :custom
    (org-roam-directory (file-truename "~/org"))
    (org-roam-completion-everywhere t)
    :config
    (org-roam-db-autosync-mode))

#+end_src

* Superior Window Switching

Ace windows using[[https://github.com/abo-abo/ace-window][ ace-window]] package for superior window switching method.

#+begin_src emacs-lisp

  (use-package ace-window
    :bind ("M-o" . ace-window))

#+end_src

* Terminal in Emacs

Use [[https://github.com/akermu/emacs-libvterm][emacs-libvterm]] package to use terminal inside Emacs. Use =C-v= keymap to open vterm in emacs.

#+begin_src emacs-lisp

  (use-package vterm)

#+end_src

** Multiple Vterm Buffers

#+begin_src emacs-lisp

  ;; Use Multi vterm to create multiple vterm buffers
  (use-package multi-vterm
    :config
    (setq multi-vterm-dedicated-window-height 50))

#+end_src

** Toggle Vterm with Ease

Use the keychord =C-c v= to toggle vterm using the [[https://github.com/jixiuf/vterm-toggle][vterm-toggle]] package.

#+begin_src emacs-lisp

  (use-package vterm-toggle
    :bind
    (:map global-map
  	("C-c v v" . vterm-toggle-cd))
    (:map vterm-mode-map
  	("s-n" . vterm-toggle-forward)
  	("s-p" . vterm-toggle-backward)))

#+end_src

* Ibuffer Instead of Buffer List
We can use the =ibuffer= in emacs instead of the default =buffer-list= with =C-x C-b=.
#+begin_src emacs-lisp

  (keymap-global-set "C-x C-b" #'ibuffer)

#+end_src

* Development
** Magit

Open magit on the same window.

#+begin_src emacs-lisp

  (use-package magit
    :after nerd-icons
    :commands magit-status
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
    (magit-format-file-function #'magit-format-file-nerd-icons))

  (use-package forge
    :after magit)

  (use-package with-editor :ensure nil)

#+end_src


*** Use diff-hl
We can use [[https://github.com/dgutov/diff-hl][diff-hl]] package to see git changes and other changes inside dired and emacs buffer
#+begin_src emacs-lisp

  (use-package diff-hl
    :hook ((prog-mode . diff-hl-mode) ;; Show in programming buffers
  	 (magit-post-refresh . #'diff-hl-magit-post-refresh)
  	 (dired-mode . diff-hl-dired-mode))) ;; Also show in dired buffers

#+end_src

