modules/nixos/Emacs.org
** Colorful Mode
#+begin_src emacs-lisp

  (use-package colorful-mode
    :custom
    (colorful-use-prefix t)
    (colorful-only-strings 'only-prog)
    (css-fontify-colors nil)
    :config
    (global-colorful-mode t)
    (add-to-list 'global-colorful-modes 'helpful-mode))

#+end_src

** Direnv Integration
Integrate direnv with Emax
#+begin_src emacs-lisp

  (use-package envrc
    :hook (after-init . envrc-global-mode))

#+end_src

** Projectile
#+begin_src emacs-lisp

  (use-package projectile
    :init
    (projectile-mode 1)
    
    :custom
    (projectile-project-search-path '("~/Development/"
    				    "~/nixdots/"))
    
    :bind (:map projectile-mode-map
    	      ("C-c p" . projectile-command-map)))

  ;; Also use consult-projectile
  (use-package consult-projectile)

#+end_src
[[https://docs.projectile.mx/projectile/index.html][Projectile]] is a project management library for Emacs.

** Smartparens
[[https://github.com/Fuco1/smartparens?tab=readme-ov-file][Smartparens]] is a package for auto-parenthesis. Electric-pair mode is okay, but Smartparens provides a lot of functionalities that electric-pair mode doesn't.

#+begin_src emacs-lisp

  (use-package smartparens
    :hook (prog-mode text-mode markdown-mode) ;; add `smartparens-mode` to these hooks
    :config
    ;; load default config
    (require 'smartparens-config))

#+end_src

** LSP

*** Eglot

#+begin_src emacs-lisp

  (use-package eglot
    :ensure nil
    :hook ((c-mode c++-mode python-mode nix-ts-mode) . eglot-ensure)
    :config
    ;; Optional performance tuning
    (setq eglot-autoshutdown t
  	eglot-send-changes-idle-time 0.5))

#+end_src

**** Booster

Make eglot load faster

#+begin_src emacs-lisp

  (use-package eglot-booster
    :after eglot
    :config (eglot-booster-mode))

#+end_src

*** Breadcrumbs

#+begin_src emacs-lisp
  (use-package breadcrumb
    :init (breadcrumb-mode)
    :config
    (setq which-func-functions #'(breadcrumb-imenu-crumbs))
    (setq breadcrumb-imenu-crumb-separator "  "))


  (use-package imenu
    :ensure nil
    :config
    (setq imenu-auto-rescan t))

#+end_src

*** Languages

**** Nix
Use [[https://github.com/purcell/emacs-nixfmt][nixfmt]] package for formatting nix files.
#+begin_src emacs-lisp

  (use-package nixfmt
    :hook (nix-ts-mode . nixfmt-on-save-mode))

#+end_src

**** Shell
Use [[https://github.com/purcell/emacs-shfmt][shfmt]] package for formatting shell scripts.
#+begin_src emacs-lisp

  (use-package shfmt
    :hook (sh-mode . shfmt-on-save-mode)
    :custom
    ;; Use 2 spaces for indentation
    (shfmt-indent 2)

    ;; Optional but sane defaults
    (shfmt-arguments '("-i" "2" "-ci")))

#+end_src

**** Treesitter

#+begin_src emacs-lisp

  (use-package nix-ts-mode
    :mode "\\.nix\\'"
    :init
    ;; Add to your init.el before loading nix-ts-mode
    (setq treesit-font-lock-level 4))

#+end_src

** Auto-Completion

Set up auto-completion for programming languages. This configuration is taken from [[https://github.com/minad/corfu#tab-only-completion][official snippets]].

#+begin_src emacs-lisp

  ;; TAB-only configuration
  (use-package corfu
    :custom
    (corfu-auto t)               ;; Enable auto completion
    (corfu-preselect 'directory) ;; Select the first candidate, except for directories

    :init
    (global-corfu-mode)

    :config
    ;; Free the RET key for less intrusive behavior.
    ;; Option 1: Unbind RET completely
    ;; (keymap-unset corfu-map "RET")
    ;; Option 2: Use RET only in shell modes
    (keymap-set corfu-map "RET" `( menu-item "" nil :filter
                                   ,(lambda (&optional _)
                                      (and (derived-mode-p 'eshell-mode 'comint-mode)
                                           #'corfu-send)))))

  (use-package cape
    ;; Bind prefix keymap providing all Cape commands under a menmonic key.
    :bind ("C-x c" . cape-prefix-map)
    :init
    ;; Add to the global default value of `completion-at-point-functions' which is
    ;; used by `completion-at-point'.  The order of the functions matters, the
    ;; first function returning a result wins.  Note that the list of buffer-local
    ;; completion functions takes precedence over the global list.
    (add-hook 'completion-at-point-functions #'cape-dabbrev)
    (add-hook 'completion-at-point-functions #'cape-file)
    (add-hook 'completion-at-point-functions #'cape-elisp-block))

#+end_src

*** Corfu Nerd Icons
Use the [[https://github.com/LuigiPiucco/nerd-icons-corfu][nerd-icons-corfu]] package for completion ui.
#+begin_src emacs-lisp

  (use-package nerd-icons-corfu
    :after (corfu nerd-icons)
    :config
    (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))

#+end_src

*** Orderless
Orderless completion style a try for filtering.
#+begin_src emacs-lisp

  ;; Orderless completions
  (use-package orderless
    :custom
    (completion-styles '(orderless basic))
    (completion-category-overrides '((file (styles partial-completion))))
    (completion-category-defaults nil)
    (completion-pcm-leading-wildcard t))

#+end_src

** Rainbow Delimiters
Enable [[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]] package  for better parentheses
#+begin_src emacs-lisp

  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

