modules/nixos/init.el

(use-package colorful-mode
  :custom
  (colorful-use-prefix t)
  (colorful-only-strings 'only-prog)
  (css-fontify-colors nil)
  :config
  (global-colorful-mode t)
  (add-to-list 'global-colorful-modes 'helpful-mode))

(use-package envrc
  :hook (after-init . envrc-global-mode))

(use-package projectile
  :init
  (projectile-mode 1)
  
  :custom
  (projectile-project-search-path '("~/Development/"
  				    "~/nixdots/"))
  
  :bind (:map projectile-mode-map
  	      ("C-c p" . projectile-command-map)))

;; Also use consult-projectile
(use-package consult-projectile)

(use-package smartparens
  :hook (prog-mode text-mode markdown-mode) ;; add `smartparens-mode` to these hooks
  :config
  ;; load default config
  (require 'smartparens-config))

(use-package eglot
  :ensure nil
  :hook ((c-mode c++-mode python-mode nix-ts-mode) . eglot-ensure)
  :config
  ;; Optional performance tuning
  (setq eglot-autoshutdown t
	eglot-send-changes-idle-time 0.5))

(use-package eglot-booster
  :after eglot
  :config (eglot-booster-mode))

(use-package breadcrumb
  :init (breadcrumb-mode)
  :config
  (setq which-func-functions #'(breadcrumb-imenu-crumbs))
  (setq breadcrumb-imenu-crumb-separator "  "))


(use-package imenu
  :ensure nil
  :config
  (setq imenu-auto-rescan t))

(use-package nixfmt
  :hook (nix-ts-mode . nixfmt-on-save-mode))

(use-package shfmt
  :hook (sh-mode . shfmt-on-save-mode)
  :custom
  ;; Use 2 spaces for indentation
  (shfmt-indent 2)

  ;; Optional but sane defaults
  (shfmt-arguments '("-i" "2" "-ci")))

(use-package nix-ts-mode
  :mode "\\.nix\\'"
  :init
  ;; Add to your init.el before loading nix-ts-mode
  (setq treesit-font-lock-level 4))

;; TAB-only configuration
(use-package corfu
  :custom
  (corfu-auto t)               ;; Enable auto completion
  (corfu-preselect 'directory) ;; Select the first candidate, except for directories

  :init
  (global-corfu-mode)

  :config
  ;; Free the RET key for less intrusive behavior.
  ;; Option 1: Unbind RET completely
  ;; (keymap-unset corfu-map "RET")
  ;; Option 2: Use RET only in shell modes
  (keymap-set corfu-map "RET" `( menu-item "" nil :filter
                                 ,(lambda (&optional _)
                                    (and (derived-mode-p 'eshell-mode 'comint-mode)
                                         #'corfu-send)))))

(use-package cape
  ;; Bind prefix keymap providing all Cape commands under a menmonic key.
  :bind ("C-x c" . cape-prefix-map)
  :init
  ;; Add to the global default value of `completion-at-point-functions' which is
  ;; used by `completion-at-point'.  The order of the functions matters, the
  ;; first function returning a result wins.  Note that the list of buffer-local
  ;; completion functions takes precedence over the global list.
  (add-hook 'completion-at-point-functions #'cape-dabbrev)
  (add-hook 'completion-at-point-functions #'cape-file)
  (add-hook 'completion-at-point-functions #'cape-elisp-block))

(use-package nerd-icons-corfu
  :after (corfu nerd-icons)
  :config
  (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))

;; Orderless completions
(use-package orderless
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles partial-completion))))
  (completion-category-defaults nil)
  (completion-pcm-leading-wildcard t))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
