modules/nixos/Emacs.org
** Embark
#+begin_src emacs-lisp

  (use-package embark
    :bind
    (("C-." . embark-act)         ;; pick some comfortable binding
     ("C-;" . embark-dwim)        ;; good alternative: M-.
     ("C-h B" . embark-bindings)) ;; alternative for `describe-bindings'

    :init

    ;; Optionally replace the key help with a completing-read interface
    (setq prefix-help-command #'embark-prefix-help-command)

    ;; Show the Embark target at point via Eldoc. You may adjust the
    ;; Eldoc strategy, if you want to see the documentation from
    ;; multiple providers. Beware that using this can be a little
    ;; jarring since the message shown in the minibuffer can be more
    ;; than one line, causing the modeline to move up and down:

    ;; (add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
    ;; (setq eldoc-documentation-strategy #'eldoc-documentation-compose-eagerly)

    ;; Add Embark to the mouse context menu. Also enable `context-menu-mode'.
    ;; (context-menu-mode 1)
    ;; (add-hook 'context-menu-functions #'embark-context-menu 100)

    :config

    ;; Hide the mode line of the Embark live/completions buffers
    (add-to-list 'display-buffer-alist
                 '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                   nil
                   (window-parameters (mode-line-format . none))))

    ;; add which key integration in embark
    (defun embark-which-key-indicator ()
      "An embark indicator that displays keymaps using which-key.
  The which-key help message will show the type and value of the
  current target followed by an ellipsis if there are further
  targets."
      (lambda (&optional keymap targets prefix)
        (if (null keymap)
            (which-key--hide-popup-ignore-command)
  	(which-key--show-keymap
  	 (if (eq (plist-get (car targets) :type) 'embark-become)
               "Become"
             (format "Act on %s '%s'%s"
                     (plist-get (car targets) :type)
                     (embark--truncate-target (plist-get (car targets) :target))
                     (if (cdr targets) "…" "")))
  	 (if prefix
               (pcase (lookup-key keymap prefix 'accept-default)
                 ((and (pred keymapp) km) km)
                 (_ (key-binding prefix 'accept-default)))
             keymap)
  	 nil nil t (lambda (binding)
                       (not (string-suffix-p "-argument" (cdr binding))))))))

    (setq embark-indicators
  	'(embark-which-key-indicator
  	  embark-highlight-indicator
  	  embark-isearch-highlight-indicator))

    (defun embark-hide-which-key-indicator (fn &rest args)
      "Hide the which-key indicator immediately when using the completing-read prompter."
      (which-key--hide-popup-ignore-command)
      (let ((embark-indicators
             (remq #'embark-which-key-indicator embark-indicators)))
        (apply fn args)))

    (advice-add #'embark-completing-read-prompter
                :around #'embark-hide-which-key-indicator))

  ;; Consult users will also want the embark-consult package.
  (use-package embark-consult
    :hook
    (embark-collect-mode . consult-preview-at-point-mode))

#+end_src

** Indent Bars

#+begin_src emacs-lisp

  (use-package indent-bars
    :hook ((prog-mode nix-ts-mode) . indent-bars-mode)) ; or whichever modes you prefer

#+end_src

* Clipboard
On wayland we can use this snippet from [[https://www.emacswiki.org/emacs/CopyAndPaste][EmacsWiki]].
#+begin_src emacs-lisp

  ;; credit: Lukas Barth at https://www.lukas-barth.net/blog/emacs-wsl-copy-clipboard/
  (setopt select-active-regions nil)

  (setopt select-enable-clipboard 't)
  (setopt select-enable-primary nil)
  (setopt interprogram-cut-function #'gui-select-text)


#+end_src

* PDF Reading
Use [[https://github.com/vedang/pdf-tools][pdf-tools]] package for reading pdfs inside emacs.
#+begin_src emacs-lisp :tangle no

  (use-package pdf-tools
    :hook
    (pdf-view-mode . #'pdf-view-roll-minor-mode) ;; Gives smoother scrolling.

    ;; disable line-numbers using this mode.
    (pdf-view-mode . (lambda () (display-line-numbers-mode -1)))
    :init
    (pdf-tools-install t))

#+end_src

Save the last visited page in pdf-view using [[https://github.com/nicolaisingh/saveplace-pdf-view][saveplace-pdf-view]].
#+begin_src emacs-lisp :tangle no

  (use-package saveplace-pdf-view
    :after (:any doc-view pdf-tools))

#+end_src

Use the new [[https://codeberg.org/MonadicSheep/emacs-reader][emacs-reader]] package which uses the =mupdf= backend instead of =poppler= backend.
#+begin_src emacs-lisp

  (use-package reader
    :commands
    (reader-mode)
    :hook
    (reader-mode . (lambda () (display-line-numbers-mode -1))))


  ;; The new version is still expecting a function that it does not provide.
  (with-eval-after-load 'reader
    (unless (fboundp 'reader-current-doc-pagenumber)
      (defalias 'reader-current-doc-pagenumber
        #'reader-dyn--current-doc-pagenumber)))


#+end_src

* TODO Elfeed Setup
Elfeed is a rss reader for emacs.

*  Music Listening
[[https://github.com/emacsmirror/emms][Emms]] (Emacs Multi-Media System) is a system to listen to music. The config is taken from [[https://emacs.stackexchange.com/a/3741][this comment on StackExchange]].
#+begin_src emacs-lisp 

  (use-package emms
    :custom
    (emms-player-list '(emms-player-mpv))
    (emms-source-file-default-directory "~/Music/")
    (emms-show-format "Playing: %s")
    (emms-info-functions '(emms-info-native))
    (emms-browser-covers #'emms-browser-cache-thumbnail-async)
    (emms-browser-thumbnail-small-size 64)
    (emms-browser-thumbnail-medium-size 128)
    :init
    (require 'emms-setup)
    (emms-all))

#+end_src

* TODO Tasks
- [ ] Refine the config. There's a lot of stuff that needs to be cleaned up and set properly.
- [ ] Configure org-journal to follow org-capture and org-agenda for journaling.
- [ ] Set up org-roam and consult-notes.
- [X] Figure out why font rendering doesn't work in org-mode when emacs starts in daemon mode.

** FIXME Emacsclient stuffs like Fonts and line-spacing vars don't work.
